// ==========================================================================================
// /notes – сторінка списку нотатків.
// ------------------------------------------------------------------------------------------
// На цій сторінці відображається перелік усіх створених нотаток.
// Реалізовано функцію пошуку за ключовим словом, а також можливість створення нової нотатки.
// ==========================================================================================

// ------------------------------------------------------------------------------------------
// Вказуємо, що цей компонент є клієнтським
// і може використовувати React Hooks та інші клієнтські функції.
'use client';

// Імпорт модуля Link для навігації між сторінками
import Link from 'next/link';

// Імпорт модуля useState - для роботи зі станом з REACT
import { useEffect, useState } from 'react';

// Імпорт модуля зі стилями компонента
import css from './NotesPage.module.css';

// Імпорт компонента SearchBox
import SearchBox from '@/components/SearchBox/SearchBox';

// Імпорт компонента NoteList
import NoteList from '@/components/NoteList/NoteList';

// Імпорт компонента Pagination
import Pagination from '@/components/Pagination/Pagination';

// Iмпорт функції для HTTP-запроса
import { fetchNotesByTag } from '@/lib/api';

// Імпорт хук useQuery, який виконує асинхронні запити та автоматично керує станами завантаження, помилок та збереженням даних, значно спрощуючи роботу з API.
// (Додатково - npm install @tanstack/react-query)
import { useQuery } from '@tanstack/react-query';

// Імпортуємо хук useQueryClient
// import { useQueryClient } from '@tanstack/react-query';

// Імпорт хук useMutation
// Мутації в React Query використовуються для виконання операцій, які змінюють дані на сервері,
// таких як створення, оновлення або видалення записів.
// import { useMutation } from '@tanstack/react-query';

// Імпорт keepPreviousData - для збереження попереднього запиту, поки не прийдуть нові дані
import { keepPreviousData } from '@tanstack/react-query';

// Імпорт хук useDebouncedCallback(callback, delay) з бібліотеки use-debounce.
// Додатково - npm install use-debounce
// Він дозволяє створити "відкладену" версію функції — тобто таку, яка не викликається
// одразу при кожному вводі символа, а лише через певний час після останньої дії.
import { useDebouncedCallback } from 'use-debounce';

interface NotePageProps {
  tag: string;
}
const NotesPage = ({ tag }: NotePageProps) => {
  // ---------------------------------------------------------------------------------------------
  // Потрібно інвалідувати кеш для конкретного queryKey, це змусить React Query
  // зробити повторний запит за колекцією даних, тобто виконати відповідний useQuery.
  // Отримуємо посилання на квері-клієнт що створювали у main.tsx
  // const queryClient = useQueryClient();

  // ---------------------------------------------------------------------------------------------
  // Оголошуємо і типизуємо стан - рядок з пошуком
  const [query, setQuery] = useState<string>('');
  // *************************************************************

  // Оголошуємо і типизуємо стан - номер поточної сторінки
  const [page, setPage] = useState<number>(1);
  // ---------------------------------------------------------------------------------------------

  // Запуск при монтажу компонента
  useEffect(() => {
    // Це функція очистки (cleanup function)
    return () => {
      // Очищаємо рядок запиту в localStorage при демонтажу компонента
      // localStorage.setItem('query', '');
      // localStorage.setItem('searchText', '');
    };
  }, []);

  // --------------------------------------------------------------------------------------------
  // хук useQuery повертає об’єкт з корисною інформацією про запит :
  //    data – дані, які були успішно отримані в результаті запиту.
  //    error – якщо запит завершився помилкою, ця властивість містить інформацію про помилку.
  //    isLoading – якщо запит ще виконується, значення буде true.
  //    isError – якщо запит не вдалося виконати (наприклад, через мережеві помилки), значення буде true.
  //    isSuccess – якщо запит успішно виконався і дані отримано, значення буде true.
  // ---------------------------------------------------------------------------------------------
  const {
    data,
    // isLoading,
    // error,
    // isError,
  } = useQuery({
    // ключ запиту - масив, який унікально ідентифікує запит і його параметри,
    // що дозволяє React Query ефективно кешувати та повторно використовувати дані для однакових запитів.
    queryKey: ['notes', query, tag, page],
    // функція запиту - асинхронна функція, яка виконує HTTP-запит і повертає дані.
    queryFn: async () => fetchNotesByTag(query, tag, page),
    // властивість яка дозволяє на час завантаження нових даних показувати попередні або тимчасові дані,
    // щоб уникнути порожнього стану або мерехтіння інтерфейсу під час очікування відповіді від сервера.
    placeholderData: keepPreviousData,
    // При refetchOnMount: true, // Виконує повторний запит при кожному монтуванні компонента
    refetchOnMount: true,
    // властивість яка дозволяє виконувати запит лише тоді, коли рядок запиту не порожній,
    // Відключена, бо хочу рендерити при пустому пошуку
    // enabled: query !== '',
  });
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Оголошуємо і типизуємо стан - загальна кількість сторінок
  const totalPages = data?.totalPages ?? 1;
  // ---------------------------------------------------------------------------------------------
  // Оголошуємо - список нотаток
  // Такий собі тернарний оператор :)
  const notes = data?.notes ?? [];

  // ---------------------------------------------------------------------------------------------
  // Використовуємо useEffect для відстеження змін в даних
  // та виклику toast-повідомлення, якщо масив нотаток порожній
  useEffect(() => {
    // Якщо в результаті запиту масив нотаток порожній, виводимо повідомлення:
    // if (data && data.notes && data.notes.length === 0) {
    //   toast.error('No notes found for your request');
    // }
  }, [data]);
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Функція зміни стану рядка запиту - отримує значення строки запиту і записує його в стан :
  // Виконана з затримкою (1000 мс) за допомогою useDebouncedCallback
  const handleSearch = useDebouncedCallback((text: string) => {
    // Скидаємо номер сторінки на 1 при новому пошуку
    setPage(1);
    // Змінюємо стан - на значення строки запиту
    setQuery(text);
  }, 1000);
  // ---------------------------------------------------------------------------------------------

  // ---------------------------------------------------------------------------------------------
  // Використовуємо useEffect для відстеження змін в даних
  useEffect(() => {
    // Зберігаємо рядок запиту в localStorage при кожній його зміні
    // *************************************************************
    // localStorage.setItem('query', JSON.stringify(query));
    // *************************************************************
  }, [query]);
  // ---------------------------------------------------------------------------------------------

  return (
    <div className={css.app}>
      <div className={css.toolbar}>
        {/* Компонент SearchBox */}
        <SearchBox onChangeText={handleSearch} />
        {/* Пагінація : */}
        {/* Умовний рендеринг компонента Pagination в залежності від кількості сторінок */}
        {totalPages > 1 && <Pagination totalPages={totalPages} setPage={setPage} page={page} />}
        {/* Посилання на сторінку створення нотатки */}
        <Link href="/notes/action/create" className={css.button}>
          Create note +
        </Link>
      </div>
      {/* Умовний рендеринг компонента NoteList в залежності від кількості нотаток */}
      {notes && notes.length > 0 && <NoteList notes={notes} />}
    </div>
  );
};

export default NotesPage;
